people/nguyenthanhvuh/old/drafts/logic.org
#+TITLE: Notes on First-Order Logic
#+date: <2021-05-24 03:39>
#+description: Notes on FoL
#+filetags: computer setup blog 
#+HTML_HEAD: <link rel="stylesheet" href="../files/org.css">

[[https://en.wikipedia.org/wiki/Conjunctive_normal_form#Conversion_into_CNF]]
* Convertion to CNF
  - exponential growth example

    - input: 
      #+begin_example
      (x1 and y1) or (x2 and y2) or (x3 and y3) or (x4 and y4) or ... or (xn and yn)
      #+end_example
    - ouput CNF has $2^n$ clauses
      
      

- Equisatisabile (equisat) :: two formulae =a= and =b= are equisat if =a= is sat iff =b= is sat (either both are sat or bot are unsat).


  =a or b= and =(a or n) and (!n o b)= are equisat.

  Note that these are equisat, but not equivalent, e.g., given =b=T, a=n=F=, the formula =a or b= is =T= but the formula =(a or n) and (!n o b)= is =F=.


* Tseitin Encoding

  Every boolean formula ~F~ can be converted into an /equivalent/ CNF formula ~F'~, but ~F'~ can be exponential in the size of ~F~.
  Tseitin encoding allows for ~F~ to be converted into an /equisatisabile/ formula ~F'~, where ~F'~ is only a linear increase in the size of ~F~.
